Revit 2024 API
ExternallyTaggedNonBReps Members
The ExternallyTaggedNonBReps type exposes the following members.
Constructors
Name | Description
ExternallyTaggedNonBReps
 Make a new empty collection of ExternallyTaggedNonBRep instances.
Methods
Name | Description
Add
 Adds a copy of the input ExternallyTaggedNonBRep to this collection.
CanAddExternallyTaggedNonBRep
 Checks if the input geometry could be added to this collection or not.
Dispose
Releases all resources used by the ExternallyTaggedNonBReps
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace